---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMasszoneCoreoffset
source: html/79bdeb0b-5682-ee6c-8505-8f21579b28eb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMasszoneCoreoffset Property

"Perimeter Zone Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisMasszoneCoreoffset { get; }
```